Revit 2027 API
RebarContainer.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<RebarContainerItem> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of RebarContainerItem)
public:
virtual IEnumerator<RebarContainerItem^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<RebarContainerItem>
override GetEnumerator : unit -> IEnumerator<RebarContainerItem>
Return Value
IEnumerator<RebarContainerItem>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace